do

function run(msg, matches)
if msg.to.type == 'channel' and is_momod(msg) then
  return 'TeleBeyond Fun Commands List'..[[
❤لیست دستورات💙:

🔴!weather [شهر|کشور]
🔹مشاهده اب و هوای شهر یا کشور مورد نظر
🔴!insta [یوزر]
🔹مشاهده مشخصات اینساگرام فرد مورد نظر
🔴!info
🔹مشخصات کامل فرد همراه با (ریپلی|یوزر)
🔴!me
🔹دیدن تعداد پیام خود در گروه
🔴!time
🔹مشاهده زمان و تاریخ
🔴!short [لینک]
🔹کوتاه کردن لینک مورد نظر
🔴!write [متن]
🔹نوشتن متن انگلیسی با فونت زیبا
🔴!tr fa-en [متن]
🔹ترجمه متن انگلیسی به فارسی
🔸برای ترجمه فارسی به انگلیسی بجای fa-en بزارید en-fa
🔹مثال :
🔵!tr fa-en Hello
🔴!calc [معادله]
🔹حساب کردن معادله
🔹مثال :
🔵!calc 3*6
➖➖➖➖➖➖➖
🔴!sticker
🔹تبدیل عکس به استیکر با ریپلی
🔴!photo
🔹تبدیل استیکر به عکس با ریپلی
🔴!photo (متن)
🔹تبدیل متن به عکس
🔴!sticker (متن)
🔹تبدیل متن به استیکر
🔴!voice (متن)
🔹تبدیل متن به ویس
🔴!mean (کلمه)
🔹معنی کردن کلمه با فرهنگ لغت معین
➖➖➖➖➖➖➖
🔴!map (شهر|کشور|مکان)
🔹نقشه شهر،کشور یا مکان مورد نظر
🔴!loc (شهر|کشور|مکان)
🔹لوکیشن شهر،کشور یا مکان مورد نظر
🔴!link (شهر|کشور|مکان)
🔹لینک نقشه شهر،کشور یا مکان مورد نظر در گوگل
🔴!‌gps (شهر|کشور|مکان)
🔹مختصات شهر،کشور یا مکان مورد نظر
➖➖➖➖➖➖➖
🔴!md [text](link)
🔹ساختن هایپر لینک
🔹مثال
🔵!md [Beyond Team](Telegram.Me/BeyondTeam)
🔴!code (متن)
🔹متن به صورت کد
🔴!bold (متن)
🔹متن به صورت بولد
🔴!italic (متن)
🔹متن به صورت ایتالیک
🔴!joke
🔹ارسال جک به صورت تصادفی
🔴!jomlak
🔹ارسال جمله های زیبا به صورت تصادفی
➖➖➖➖➖➖➖
1_شما میتونید از / ! استفاده کنید 

2_برای دریافت لینک گروه پشتیبانی از دستور
!linksp
استفاده کنید.

3_حتما ربات @TeleBeyondApiBot رو به گروهتون دعوت کنید چون ربات مکمل هست و با هم کار میکنند
➖➖➖➖➖➖➖
Version 2.5 @TeleBeyond
Team Channel : @BeyondTeam
Sudo Users : 👤
@SoLiD021
@MrHalix
@idivanmanheb ]]
end
end
return {
  description = "Robot and Creator About", 
  usage = "/ver : robot info",
  patterns = {
    "^[!/]help$",
    "^([Hh]elp)$",
    
  }, 
  run = run 
}

end
